android/power/01.driver/02.Frameworks.org
#+FILE: Power supply子系统之框架
#+AUTHOR:      wildbook
#+DATE:        2017年01月12日18:13:13
#+EMAIL:       www762268@foxmail.com
#+DESCRIPTION: 掌握power supply子系统框架
#+KEYWORDS:    power,pmic,bsp,linux
#+LANGUAGE:    language for HTML, e.g. ‘en’ (org-export-default-language)
#+TEXT:        Some descriptive text to be inserted at the beginning.
#+TEXT:        Several lines may be given.
#+OPTIONS:     H:2 num:t toc:t \n:nil @:t ::t |:t ^:t f:t TeX:t ...
#+LINK_UP:     the ``up'' link of an exported page
#+LINK_HOME:   the ``home'' link of an exported page
#+LATEX_HEADER: extra line(s) for the LaTeX header, like \usepackage{xyz}
* 参考文档
  + *Code*:
    kernel/drivers/power/power_supply_core.c\\
    kernel/drivers/power/power_supply_sysfs.c\\
    kernel/drivers/power/power_supply_leds.c\\
    kernel/drivers/power/power_supply.h *局部头文件*\\
    kernel/include/linux/power_supply.h *全局头文件*\\
  + *dts*:
  + *docs*
  + *sysfs*:
* 提供的API
**  power_supply.h:全部
*** extern struct power_supply *power_supply_get_by_name(char *name);
    + *功能*:通过名字获取power_supply设备
    + *参数*
    + *返回值*:成功返回地址,失败返回NULL
*** extern void power_supply_changed(struct power_supply *psy);
    + *功能*:改变充电状态灯
    + *参数*
    + *返回值*
*** extern int power_supply_am_i_supplied(struct power_supply *psy);
    + *功能*:不明白干吗的,但依赖驱动的get_property()函数,不匹配的话无法工作
    + *参数*
    + *返回值*
*** extern int power_supply_set_battery_charged(struct power_supply *psy);
    + *功能*:设置电池充电属性,
      *注意*:依赖于set_charged()函数
    + *参数*
    + *返回值*
*** extern int power_supply_set_current_limit(struct power_supply *psy, int limit);
    + *功能*
      设置最大充电电流,当limit=0时,将禁用充电器
      *注意*:依赖于set_property()函数
    + *参数*
    + *返回值*
*** extern int power_supply_set_voltage_limit(struct power_supply *psy, int limit);
    + *功能*
      设置最大充电电压,当limit=0时,将禁用充电器
      *注意*:依赖于set_property()函数
    + *参数*
    + *返回值*
*** extern int power_supply_set_online(struct power_supply *psy, bool enable);
    + *功能*
      设置电源的链接状态
      *注意*:依赖于set_property()函数
    + *参数*
      允许/禁止电源链接
    + *返回值*
*** extern int power_supply_set_health_state(struct power_supply *psy, int health);
    + *功能*:设置电源健康状态"过热,热,冷等等"
      *注意*:依赖于set_property()函数
    + *参数*
    + *返回值*
*** extern int power_supply_set_present(struct power_supply *psy, bool enable);
    + *功能*
      设置电源当前状态,电池是否存在
    + *参数*
      电池存在/不存在
    + *返回值*
*** extern int power_supply_set_scope(struct power_supply *psy, int scope);
    + *功能*:设置电源范围"Unknown","System","Device"等等
      *注意*:依赖于set_property()函数
    + *参数*
    + *返回值*
*** extern int power_supply_set_charge_type(struct power_supply *psy, int type);
    + *功能*:设置电源充电类型"Unknow","N/A","Fast"等等
      *注意*:依赖于set_property()函数
    + *参数*
    + *返回值*
*** extern int power_supply_set_supply_type(struct power_supply *psy, enum power_supply_type supply_type);
    + *功能*:设置电源类型"Battery","USB","USB_DCP"等等
      *注意*:依赖于set_property()函数
    + *参数*
    + *返回值*
*** extern int power_supply_is_system_supplied(void);
    + *功能*:不懂
    + *参数*
      *注意*:依赖于get_property()函数
    + *返回值*
*** extern int power_supply_register(struct device *parent, struct power_supply *psy);
    + *功能*
      power_supply设备的注册
    + *参数*
      parent:父节点
      psy:
    + *返回值*
*** extern void power_supply_unregister(struct power_supply *psy);
    + *功能*:power_supply设备的注销
    + *参数*
    + *返回值*
*** extern int power_supply_powers(struct power_supply *psy, struct device *dev);
    + *功能*:创建链接,软链接名为powers *未解决*:没找到对应的sysfs文件
    + *参数*
    + *返回值*
**  power_supply.h:局部
   + *power_supply_sysfs.c*
     + extern void power_supply_init_attrs(struct device_type *dev_type);
       *功能*:初始化dev_type,把power_supply_attrs.attr和power_supply_attr_is_visible,填充到
       dev_type->groups中
     + extern int power_supply_uevent(struct device *dev, struct kobj_uevent_env *env);
       *功能*:将/sys/class/power_supply/battery/xxx里的信息发送到uevent文件中
   + *power_supply_leds.c*
     + extern void power_supply_update_leds(struct power_supply *psy);
       *功能*:充电,发电功率触发led
     + extern int power_supply_create_triggers(struct power_supply *psy);
       *功能*:创建触发器
     + extern void power_supply_remove_triggers(struct power_supply *psy);
       *功能*:删除触发器
