android/power/01.driver/02.Frameworks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="language for HTML, e.g. ‘en’ (org-export-default-language)" xml:lang="language for HTML, e.g. ‘en’ (org-export-default-language)">
<head>
<!-- 2017-03-09 四 17:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="wildbook" />
<meta  name="description" content="掌握power supply子系统框架"
 />
<meta  name="keywords" content="power,pmic,bsp,linux" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 参考文档</a></li>
<li><a href="#orgheadline20">2. 提供的API</a>
<ul>
<li><a href="#orgheadline18">2.1. power<sub>supply.h</sub>:全部</a></li>
<li><a href="#orgheadline19">2.2. power<sub>supply.h</sub>:局部</a></li>
</ul>
</li>
<li><a href="#orgheadline21">3. 关键结构体</a></li>
<li><a href="#orgheadline25">4. Code</a>
<ul>
<li><a href="#orgheadline22">4.1. power<sub>supply</sub><sub>core.c</sub></a></li>
<li><a href="#orgheadline23">4.2. power<sub>supply</sub><sub>sysfs.c</sub></a></li>
<li><a href="#orgheadline24">4.3. power<sub>supply</sub><sub>leds.c</sub></a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 参考文档</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><b>Code</b>:
kernel/drivers/power/power<sub>supply</sub><sub>core.c</sub><br  />
kernel/drivers/power/power<sub>supply</sub><sub>sysfs.c</sub><br  />
kernel/drivers/power/power<sub>supply</sub><sub>leds.c</sub><br  />
kernel/drivers/power/power<sub>supply.h</sub> <b>局部头文件</b><br  />
kernel/include/linux/power<sub>supply.h</sub> <b>全局头文件</b><br  /></li>
<li><b>dts</b>:</li>
<li><b>docs</b></li>
<li><b>sysfs</b>:</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline20" class="outline-2">
<h2 id="orgheadline20"><span class="section-number-2">2</span> 提供的API</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">2.1</span> power<sub>supply.h</sub>:全部</h3>
<div class="outline-text-3" id="text-2-1">
</div><ol class="org-ol"><li><a id="orgheadline2"></a>extern struct power<sub>supply</sub> *power<sub>supply</sub><sub>get</sub><sub>by</sub><sub>name</sub>(char *name);<br  /><div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li><b>功能</b>:通过名字获取power<sub>supply设备</sub></li>
<li><b>参数</b></li>
<li><b>返回值</b>:成功返回地址,失败返回NULL</li>
</ul>
</div></li>
<li><a id="orgheadline3"></a>extern void power<sub>supply</sub><sub>changed</sub>(struct power<sub>supply</sub> *psy);<br  /><div class="outline-text-4" id="text-2-1-2">
<ul class="org-ul">
<li><b>功能</b>:改变充电状态灯</li>
<li><b>参数</b></li>
<li><b>返回值</b></li>
</ul>
</div></li>
<li><a id="orgheadline4"></a>extern int power<sub>supply</sub><sub>am</sub><sub>i</sub><sub>supplied</sub>(struct power<sub>supply</sub> *psy);<br  /><div class="outline-text-4" id="text-2-1-3">
<ul class="org-ul">
<li><b>功能</b>:不明白干吗的,但依赖驱动的get<sub>property</sub>()函数,不匹配的话无法工作</li>
<li><b>参数</b></li>
<li><b>返回值</b></li>
</ul>
</div></li>
<li><a id="orgheadline5"></a>extern int power<sub>supply</sub><sub>set</sub><sub>battery</sub><sub>charged</sub>(struct power<sub>supply</sub> *psy);<br  /><div class="outline-text-4" id="text-2-1-4">
<ul class="org-ul">
<li><b>功能</b>:设置电池充电属性,
<b>注意</b>:依赖于set<sub>charged</sub>()函数</li>
<li><b>参数</b></li>
<li><b>返回值</b></li>
</ul>
</div></li>
<li><a id="orgheadline6"></a>extern int power<sub>supply</sub><sub>set</sub><sub>current</sub><sub>limit</sub>(struct power<sub>supply</sub> *psy, int limit);<br  /><div class="outline-text-4" id="text-2-1-5">
<ul class="org-ul">
<li><b>功能</b>
设置最大充电电流,当limit=0时,将禁用充电器
<b>注意</b>:依赖于set<sub>property</sub>()函数</li>
<li><b>参数</b></li>
<li><b>返回值</b></li>
</ul>
</div></li>
<li><a id="orgheadline7"></a>extern int power<sub>supply</sub><sub>set</sub><sub>voltage</sub><sub>limit</sub>(struct power<sub>supply</sub> *psy, int limit);<br  /><div class="outline-text-4" id="text-2-1-6">
<ul class="org-ul">
<li><b>功能</b>
设置最大充电电压,当limit=0时,将禁用充电器
<b>注意</b>:依赖于set<sub>property</sub>()函数</li>
<li><b>参数</b></li>
<li><b>返回值</b></li>
</ul>
</div></li>
<li><a id="orgheadline8"></a>extern int power<sub>supply</sub><sub>set</sub><sub>online</sub>(struct power<sub>supply</sub> *psy, bool enable);<br  /><div class="outline-text-4" id="text-2-1-7">
<ul class="org-ul">
<li><b>功能</b>
设置电源的链接状态
<b>注意</b>:依赖于set<sub>property</sub>()函数</li>
<li><b>参数</b>
      允许/禁止电源链接</li>
<li><b>返回值</b></li>
</ul>
</div></li>
<li><a id="orgheadline9"></a>extern int power<sub>supply</sub><sub>set</sub><sub>health</sub><sub>state</sub>(struct power<sub>supply</sub> *psy, int health);<br  /><div class="outline-text-4" id="text-2-1-8">
<ul class="org-ul">
<li><b>功能</b>:设置电源健康状态"过热,热,冷等等"
<b>注意</b>:依赖于set<sub>property</sub>()函数</li>
<li><b>参数</b></li>
<li><b>返回值</b></li>
</ul>
</div></li>
<li><a id="orgheadline10"></a>extern int power<sub>supply</sub><sub>set</sub><sub>present</sub>(struct power<sub>supply</sub> *psy, bool enable);<br  /><div class="outline-text-4" id="text-2-1-9">
<ul class="org-ul">
<li><b>功能</b>
      设置电源当前状态,电池是否存在</li>
<li><b>参数</b>
      电池存在/不存在</li>
<li><b>返回值</b></li>
</ul>
</div></li>
<li><a id="orgheadline11"></a>extern int power<sub>supply</sub><sub>set</sub><sub>scope</sub>(struct power<sub>supply</sub> *psy, int scope);<br  /><div class="outline-text-4" id="text-2-1-10">
<ul class="org-ul">
<li><b>功能</b>:设置电源范围"Unknown","System","Device"等等
<b>注意</b>:依赖于set<sub>property</sub>()函数</li>
<li><b>参数</b></li>
<li><b>返回值</b></li>
</ul>
</div></li>
<li><a id="orgheadline12"></a>extern int power<sub>supply</sub><sub>set</sub><sub>charge</sub><sub>type</sub>(struct power<sub>supply</sub> *psy, int type);<br  /><div class="outline-text-4" id="text-2-1-11">
<ul class="org-ul">
<li><b>功能</b>:设置电源充电类型"Unknow","N/A","Fast"等等
<b>注意</b>:依赖于set<sub>property</sub>()函数</li>
<li><b>参数</b></li>
<li><b>返回值</b></li>
</ul>
</div></li>
<li><a id="orgheadline13"></a>extern int power<sub>supply</sub><sub>set</sub><sub>supply</sub><sub>type</sub>(struct power<sub>supply</sub> *psy, enum power<sub>supply</sub><sub>type</sub> supply<sub>type</sub>);<br  /><div class="outline-text-4" id="text-2-1-12">
<ul class="org-ul">
<li><b>功能</b>:设置电源类型"Battery","USB","USB<sub>DCP</sub>"等等
<b>注意</b>:依赖于set<sub>property</sub>()函数</li>
<li><b>参数</b></li>
<li><b>返回值</b></li>
</ul>
</div></li>
<li><a id="orgheadline14"></a>extern int power<sub>supply</sub><sub>is</sub><sub>system</sub><sub>supplied</sub>(void);<br  /><div class="outline-text-4" id="text-2-1-13">
<ul class="org-ul">
<li><b>功能</b>:不懂</li>
<li><b>参数</b>
      <b>注意</b>:依赖于get<sub>property</sub>()函数</li>
<li><b>返回值</b></li>
</ul>
</div></li>
<li><a id="orgheadline15"></a>extern int power<sub>supply</sub><sub>register</sub>(struct device *parent, struct power<sub>supply</sub> *psy);<br  /><div class="outline-text-4" id="text-2-1-14">
<ul class="org-ul">
<li><b>功能</b>
      power<sub>supply设备的注册</sub></li>
<li><b>参数</b>
parent:父节点
psy:</li>
<li><b>返回值</b></li>
</ul>
</div></li>
<li><a id="orgheadline16"></a>extern void power<sub>supply</sub><sub>unregister</sub>(struct power<sub>supply</sub> *psy);<br  /><div class="outline-text-4" id="text-2-1-15">
<ul class="org-ul">
<li><b>功能</b>:power<sub>supply设备的注销</sub></li>
<li><b>参数</b></li>
<li><b>返回值</b></li>
</ul>
</div></li>
<li><a id="orgheadline17"></a>extern int power<sub>supply</sub><sub>powers</sub>(struct power<sub>supply</sub> *psy, struct device *dev);<br  /><div class="outline-text-4" id="text-2-1-16">
<ul class="org-ul">
<li><b>功能</b>:创建链接,软链接名为powers <b>未解决</b>:没找到对应的sysfs文件</li>
<li><b>参数</b></li>
<li><b>返回值</b></li>
</ul>
</div></li></ol>
</div>
<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">2.2</span> power<sub>supply.h</sub>:局部</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><b>power<sub>supply</sub><sub>sysfs.c</sub></b>
<ul class="org-ul">
<li>extern void power<sub>supply</sub><sub>init</sub><sub>attrs</sub>(struct device<sub>type</sub> <b>dev<sub>type</sub>);
*功能</b>:初始化dev<sub>type,把power</sub><sub>supply</sub><sub>attrs.attr和power</sub><sub>supply</sub><sub>attr</sub><sub>is</sub><sub>visible,填充到</sub>
dev<sub>type</sub>-&gt;groups中</li>
<li>extern int power<sub>supply</sub><sub>uevent</sub>(struct device <b>dev, struct kobj<sub>uevent</sub><sub>env</sub> *env);
*功能</b>:将/sys/class/power<sub>supply</sub>/battery/xxx里的信息发送到uevent文件中</li>
</ul></li>
<li><b>power<sub>supply</sub><sub>leds.c</sub></b>
<ul class="org-ul">
<li>extern void power<sub>supply</sub><sub>update</sub><sub>leds</sub>(struct power<sub>supply</sub> <b>psy);
*功能</b>:充电,发电功率触发led</li>
<li>extern int power<sub>supply</sub><sub>create</sub><sub>triggers</sub>(struct power<sub>supply</sub> <b>psy);
*功能</b>:创建触发器</li>
<li>extern void power<sub>supply</sub><sub>remove</sub><sub>triggers</sub>(struct power<sub>supply</sub> <b>psy);
*功能</b>:删除触发器</li>
</ul></li>
</ul>
</div>
</div>
</div>
