android/power/01.driver/02.Frameworks.org
* 关键结构体
  1. power_supply
     #+begin_src cpp
     struct power_supply {
        const char *name;  //名称，对应于/sys/class/power_supply/xxx/文件夹
        enum power_supply_type type;//电源类型，表示该电源为电池，主电源，USB等
        enum power_supply_property *properties;//提供属性的数组指针
        size_t num_properties;//属性的数组大小

        char **supplied_to;   //支持xx
        size_t num_supplicants;//数量

        char **supplied_from; //从xx获取支持
        size_t num_supplies;//数量
     #ifdef CONFIG_OF
        struct device_node *of_node; //设备树中的设备节点
     #endif
        //获取属性
        int (*get_property)(struct power_supply *psy, enum power_supply_property psp, union power_supply_propval *val);
        //设置属性
        int (*set_property)(struct power_supply *psy, enum power_supply_property psp, const union power_supply_propval *val);
        //设置属性为可写的属性
        int (*property_is_writeable)(struct power_supply *psy, enum power_supply_property psp);
        //外部电源变化时所做的工作
        void (*external_power_changed)(struct power_supply *psy);
        //设置充电状态
        void (*set_charged)(struct power_supply *psy);

        /* For APM emulation, think legacy userspace. */
        int use_for_apm;

        /* private */
        struct device *dev;
        struct work_struct changed_work;
        spinlock_t changed_lock;
        bool changed;
     #ifdef CONFIG_THERMAL
	      struct thermal_zone_device *tzd;
	      struct thermal_cooling_device *tcd;
     #endif  

     #ifdef CONFIG_LEDS_TRIGGERS  //led触发器
	      struct led_trigger *charging_full_trig;
	      char *charging_full_trig_name;
	      struct led_trigger *charging_trig;
	      char *charging_trig_name;
	      struct led_trigger *full_trig;
	      char *full_trig_name;
	      struct led_trigger *online_trig;
	      char *online_trig_name;
	      struct led_trigger *charging_blink_full_solid_trig;
	      char *charging_blink_full_solid_trig_name;
     #endif
     };
     #+end_src
  2. power_supply_type(电源类型)
     #+begin_src cpp
     enum power_supply_type {
        POWER_SUPPLY_TYPE_UNKNOWN = 0,
        POWER_SUPPLY_TYPE_BATTERY,  //电池
        POWER_SUPPLY_TYPE_UPS,      //
        POWER_SUPPLY_TYPE_MAINS,    //主电源
        //标准充电端口
        POWER_SUPPLY_TYPE_USB,		/* Standard Downstream Port */
        //专业充电端口
        POWER_SUPPLY_TYPE_USB_DCP,	/* Dedicated Charging Port */
        //充电下线端口
        POWER_SUPPLY_TYPE_USB_CDP,	/* Charging Downstream Port */
        //附件充电器适配器
        POWER_SUPPLY_TYPE_USB_ACA,	/* Accessory Charger Adapters */
        //高压DCP
        POWER_SUPPLY_TYPE_USB_HVDCP,	/* High Voltage DCP */
        //高效率高压DCP
        POWER_SUPPLY_TYPE_USB_HVDCP_3,	/* Efficient High Voltage DCP */
        POWER_SUPPLY_TYPE_WIRELESS,	/* Accessory Charger Adapters 附件充电器适配器*/
        POWER_SUPPLY_TYPE_BMS,		/* Battery Monitor System 电池检测系统*/
        POWER_SUPPLY_TYPE_USB_PARALLEL,		/* USB Parallel Path ,USB并行路径*/
        POWER_SUPPLY_TYPE_WIPOWER,		/* Wipower 无线充电*/
      };
     #+end_src
  3. power_supply_property(电源属性)
     #+begin_src cpp
     enum power_supply_property {
        /* properties of type `int' */
        power_supply_prop_status = 0,   //类型
        power_supply_prop_charge_type,  //充电类型
        power_supply_prop_health,
        power_supply_prop_present,      //电池是否存在
        power_supply_prop_online,       //电源是否连接
        power_supply_prop_authentic,
        power_supply_prop_battery_charging_enabled, //电池充电允许
        power_supply_prop_charging_enabled,  //允许充电
        power_supply_prop_technology,

        power_supply_prop_cycle_count,
        power_supply_prop_voltage_max,   //最大电压
        power_supply_prop_voltage_min,   //最小电压
        power_supply_prop_voltage_max_design,
        power_supply_prop_voltage_min_design,
        power_supply_prop_voltage_now,
        power_supply_prop_voltage_avg,
        power_supply_prop_voltage_ocv,
        power_supply_prop_input_voltage_regulation,
        power_supply_prop_current_max,
        power_supply_prop_input_current_max,
        power_supply_prop_input_current_trim,
        power_supply_prop_input_current_settled,
        power_supply_prop_vchg_loop_dbc_bypass,
        power_supply_prop_current_now,
        power_supply_prop_current_avg,
        power_supply_prop_power_now,
        power_supply_prop_power_avg,

        power_supply_prop_charge_full_design,
        power_supply_prop_charge_empty_design,
        power_supply_prop_charge_full,
        power_supply_prop_charge_empty,
        power_supply_prop_charge_now,
        power_supply_prop_charge_now_raw,
        power_supply_prop_charge_now_error,
        power_supply_prop_charge_avg,
        power_supply_prop_charge_counter,
        power_supply_prop_charge_counter_shadow,
        power_supply_prop_constant_charge_current,
        power_supply_prop_constant_charge_current_max,
        power_supply_prop_constant_charge_voltage,
        power_supply_prop_constant_charge_voltage_max,
        power_supply_prop_charge_control_limit,
        power_supply_prop_charge_control_limit_max,

        power_supply_prop_energy_full_design,
        power_supply_prop_energy_empty_design,
        power_supply_prop_energy_full,
        power_supply_prop_energy_empty,
        power_supply_prop_energy_now,
        power_supply_prop_energy_avg,
        power_supply_prop_hi_power,
        power_supply_prop_low_power,
        power_supply_prop_capacity, /* in percents! */
        power_supply_prop_capacity_alert_min, /* in percents! */
        power_supply_prop_capacity_alert_max, /* in percents! */
        power_supply_prop_capacity_level,
        power_supply_prop_capacity_raw,
        power_supply_prop_temp,
        power_supply_prop_temp_alert_min,
        power_supply_prop_temp_alert_max,
        power_supply_prop_cool_temp,
        power_supply_prop_warm_temp,
        power_supply_prop_temp_ambient,
        power_supply_prop_temp_ambient_alert_min,
        power_supply_prop_temp_ambient_alert_max,
        power_supply_prop_time_to_empty_now,
        power_supply_prop_time_to_empty_avg,
        power_supply_prop_time_to_full_now,
        power_supply_prop_time_to_full_avg,
        power_supply_prop_type, /* use power_supply.type instead */
        power_supply_prop_scope,
        power_supply_prop_system_temp_level,
        power_supply_prop_resistance,
        power_supply_prop_resistance_capacitive,
        /* unit is in ohms due to id being typically in kohm range */
        power_supply_prop_resistance_id,
        power_supply_prop_resistance_now,
        /* local extensions */
        power_supply_prop_usb_hc,
        power_supply_prop_usb_otg,
        power_supply_prop_charge_enabled,   //充电允许
        power_supply_prop_flash_current_max,
        power_supply_prop_update_now,
        power_supply_prop_esr_count,
        power_supply_prop_safety_timer_enable,
        power_supply_prop_charge_done,
        power_supply_prop_flash_active,
        power_supply_prop_flash_trigger,
        power_supply_prop_force_tlim,
        power_supply_prop_dp_dm,
        power_supply_prop_input_current_limited,
        power_supply_prop_input_current_now,
        power_supply_prop_rerun_aicl,
        power_supply_prop_cycle_count_id,
        power_supply_prop_safety_timer_expired,
        power_supply_prop_restricted_charging,
        //sun zhangyang add for task 1133932 begin
      #if defined(config_tct_8x76_idol4)
          power_supply_prop_tcl_fixtemp,
          power_supply_prop_tcl_fixcapacity,
      #endif
          //sun zhangyang add for task 1133932 end
        power_supply_prop_allow_hvdcp3,
          power_supply_prop_xo_thermal,//[feature] mod-by sun zhangyang for defect2167030,2016.05.18
        /* local extensions of type int64_t */
        power_supply_prop_charge_counter_ext,
        /* properties of type `const char *' */
        power_supply_prop_model_name,
        power_supply_prop_manufacturer,
        power_supply_prop_serial_number,
        power_supply_prop_battery_type,
      };
     #+end_src
  4. power_supply_info
     #+begin_src cpp
     struct power_supply_info {
        const char *name;      //名字
        int technology;        //技术:电池类型
        int voltage_max_design;//最大电压
        int voltage_min_design;//最小电压
        int charge_full_design;//充满电电压
        int charge_empty_design;//
        int energy_full_design; //
        int energy_empty_design;//
        int use_for_apm;//
      };
     #+end_src
