android/power/01.driver/02.Frameworks.html
<div id="outline-container-orgheadline21" class="outline-2">
<h2 id="orgheadline21"><span class="section-number-2">3</span> 关键结构体</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><p>
power<sub>supply</sub>
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">power_supply</span> {
   <span style="color: #859900; font-weight: bold;">const</span> <span style="color: #b58900;">char</span> *<span style="color: #268bd2;">name</span>;  <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#21517;&#31216;&#65292;&#23545;&#24212;&#20110;/sys/class/power_supply/xxx/&#25991;&#20214;&#22841;</span>
   <span style="color: #859900; font-weight: bold;">enum</span> <span style="color: #b58900;">power_supply_type</span> <span style="color: #268bd2;">type</span>;<span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#30005;&#28304;&#31867;&#22411;&#65292;&#34920;&#31034;&#35813;&#30005;&#28304;&#20026;&#30005;&#27744;&#65292;&#20027;&#30005;&#28304;&#65292;USB&#31561;</span>
   <span style="color: #859900; font-weight: bold;">enum</span> <span style="color: #b58900;">power_supply_property</span> *<span style="color: #268bd2;">properties</span>;<span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#25552;&#20379;&#23646;&#24615;&#30340;&#25968;&#32452;&#25351;&#38024;</span>
   <span style="color: #b58900;">size_t</span> <span style="color: #268bd2;">num_properties</span>;<span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#23646;&#24615;&#30340;&#25968;&#32452;&#22823;&#23567;</span>

   <span style="color: #b58900;">char</span> **<span style="color: #268bd2;">supplied_to</span>;   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#25903;&#25345;xx</span>
   <span style="color: #b58900;">size_t</span> <span style="color: #268bd2;">num_supplicants</span>;<span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#25968;&#37327;</span>

   <span style="color: #b58900;">char</span> **<span style="color: #268bd2;">supplied_from</span>; <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#20174;xx&#33719;&#21462;&#25903;&#25345;</span>
   <span style="color: #b58900;">size_t</span> <span style="color: #268bd2;">num_supplies</span>;<span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#25968;&#37327;</span>
<span style="color: #268bd2;">#ifdef</span> CONFIG_OF
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">device_node</span> *<span style="color: #268bd2;">of_node</span>; <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#35774;&#22791;&#26641;&#20013;&#30340;&#35774;&#22791;&#33410;&#28857;</span>
<span style="color: #268bd2;">#endif</span>
   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#33719;&#21462;&#23646;&#24615;</span>
   <span style="color: #b58900;">int</span> (*<span style="color: #268bd2;">get_property</span>)(<span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">power_supply</span> *<span style="color: #268bd2;">psy</span>, <span style="color: #859900; font-weight: bold;">enum</span> <span style="color: #b58900;">power_supply_property</span> <span style="color: #268bd2;">psp</span>, <span style="color: #859900; font-weight: bold;">union</span> <span style="color: #b58900;">power_supply_propval</span> *<span style="color: #268bd2;">val</span>);
   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#35774;&#32622;&#23646;&#24615;</span>
   <span style="color: #b58900;">int</span> (*<span style="color: #268bd2;">set_property</span>)(<span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">power_supply</span> *<span style="color: #268bd2;">psy</span>, <span style="color: #859900; font-weight: bold;">enum</span> <span style="color: #b58900;">power_supply_property</span> <span style="color: #268bd2;">psp</span>, <span style="color: #859900; font-weight: bold;">const</span> <span style="color: #859900; font-weight: bold;">union</span> <span style="color: #b58900;">power_supply_propval</span> *<span style="color: #268bd2;">val</span>);
   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#35774;&#32622;&#23646;&#24615;&#20026;&#21487;&#20889;&#30340;&#23646;&#24615;</span>
   <span style="color: #b58900;">int</span> (*<span style="color: #268bd2;">property_is_writeable</span>)(<span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">power_supply</span> *<span style="color: #268bd2;">psy</span>, <span style="color: #859900; font-weight: bold;">enum</span> <span style="color: #b58900;">power_supply_property</span> <span style="color: #268bd2;">psp</span>);
   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#22806;&#37096;&#30005;&#28304;&#21464;&#21270;&#26102;&#25152;&#20570;&#30340;&#24037;&#20316;</span>
   <span style="color: #b58900;">void</span> (*<span style="color: #268bd2;">external_power_changed</span>)(<span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">power_supply</span> *<span style="color: #268bd2;">psy</span>);
   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#35774;&#32622;&#20805;&#30005;&#29366;&#24577;</span>
   <span style="color: #b58900;">void</span> (*<span style="color: #268bd2;">set_charged</span>)(<span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">power_supply</span> *<span style="color: #268bd2;">psy</span>);

   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">For APM emulation, think legacy userspace. */</span>
   <span style="color: #b58900;">int</span> <span style="color: #268bd2;">use_for_apm</span>;

   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">private */</span>
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">device</span> *<span style="color: #268bd2;">dev</span>;
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">work_struct</span> <span style="color: #268bd2;">changed_work</span>;
   <span style="color: #b58900;">spinlock_t</span> <span style="color: #268bd2;">changed_lock</span>;
   <span style="color: #b58900;">bool</span> <span style="color: #268bd2;">changed</span>;
<span style="color: #268bd2;">#ifdef</span> CONFIG_THERMAL
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">thermal_zone_device</span> *<span style="color: #268bd2;">tzd</span>;
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">thermal_cooling_device</span> *<span style="color: #268bd2;">tcd</span>;
<span style="color: #268bd2;">#endif</span>  

<span style="color: #268bd2;">#ifdef</span> CONFIG_LEDS_TRIGGERS  <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">led&#35302;&#21457;&#22120;</span>
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">led_trigger</span> *<span style="color: #268bd2;">charging_full_trig</span>;
   <span style="color: #b58900;">char</span> *<span style="color: #268bd2;">charging_full_trig_name</span>;
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">led_trigger</span> *<span style="color: #268bd2;">charging_trig</span>;
   <span style="color: #b58900;">char</span> *<span style="color: #268bd2;">charging_trig_name</span>;
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">led_trigger</span> *<span style="color: #268bd2;">full_trig</span>;
   <span style="color: #b58900;">char</span> *<span style="color: #268bd2;">full_trig_name</span>;
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">led_trigger</span> *<span style="color: #268bd2;">online_trig</span>;
   <span style="color: #b58900;">char</span> *<span style="color: #268bd2;">online_trig_name</span>;
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">led_trigger</span> *<span style="color: #268bd2;">charging_blink_full_solid_trig</span>;
   <span style="color: #b58900;">char</span> *<span style="color: #268bd2;">charging_blink_full_solid_trig_name</span>;
<span style="color: #268bd2;">#endif</span>
};
</pre>
</div></li>
<li><p>
power<sub>supply</sub><sub>type</sub>(电源类型)
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #859900; font-weight: bold;">enum</span> <span style="color: #b58900;">power_supply_type</span> {
   <span style="color: #268bd2;">POWER_SUPPLY_TYPE_UNKNOWN</span> = <span style="color: #6c71c4;">0</span>,
   <span style="color: #268bd2;">POWER_SUPPLY_TYPE_BATTERY</span>,  <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#30005;&#27744;</span>
   <span style="color: #268bd2;">POWER_SUPPLY_TYPE_UPS</span>,      <span style="color: #93a1a1;">//</span>
   <span style="color: #268bd2;">POWER_SUPPLY_TYPE_MAINS</span>,    <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#20027;&#30005;&#28304;</span>
   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#26631;&#20934;&#20805;&#30005;&#31471;&#21475;</span>
   <span style="color: #268bd2;">POWER_SUPPLY_TYPE_USB</span>,    <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">Standard Downstream Port */</span>
   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#19987;&#19994;&#20805;&#30005;&#31471;&#21475;</span>
   <span style="color: #268bd2;">POWER_SUPPLY_TYPE_USB_DCP</span>,  <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">Dedicated Charging Port */</span>
   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#20805;&#30005;&#19979;&#32447;&#31471;&#21475;</span>
   <span style="color: #268bd2;">POWER_SUPPLY_TYPE_USB_CDP</span>,  <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">Charging Downstream Port */</span>
   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#38468;&#20214;&#20805;&#30005;&#22120;&#36866;&#37197;&#22120;</span>
   <span style="color: #268bd2;">POWER_SUPPLY_TYPE_USB_ACA</span>,  <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">Accessory Charger Adapters */</span>
   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#39640;&#21387;DCP</span>
   <span style="color: #268bd2;">POWER_SUPPLY_TYPE_USB_HVDCP</span>,  <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">High Voltage DCP */</span>
   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#39640;&#25928;&#29575;&#39640;&#21387;DCP</span>
   <span style="color: #268bd2;">POWER_SUPPLY_TYPE_USB_HVDCP_3</span>,  <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">Efficient High Voltage DCP */</span>
   <span style="color: #268bd2;">POWER_SUPPLY_TYPE_WIRELESS</span>, <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">Accessory Charger Adapters &#38468;&#20214;&#20805;&#30005;&#22120;&#36866;&#37197;&#22120;*/</span>
   <span style="color: #268bd2;">POWER_SUPPLY_TYPE_BMS</span>,    <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">Battery Monitor System &#30005;&#27744;&#26816;&#27979;&#31995;&#32479;*/</span>
   <span style="color: #268bd2;">POWER_SUPPLY_TYPE_USB_PARALLEL</span>,   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">USB Parallel Path ,USB&#24182;&#34892;&#36335;&#24452;*/</span>
   <span style="color: #268bd2;">POWER_SUPPLY_TYPE_WIPOWER</span>,    <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">Wipower &#26080;&#32447;&#20805;&#30005;*/</span>
 };
</pre>
</div></li>
<li><p>
power<sub>supply</sub><sub>property</sub>(电源属性)
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #859900; font-weight: bold;">enum</span> <span style="color: #b58900;">power_supply_property</span> {
   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">properties of type `int' */</span>
   <span style="color: #268bd2;">power_supply_prop_status</span> = <span style="color: #6c71c4;">0</span>,   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#31867;&#22411;</span>
   <span style="color: #268bd2;">power_supply_prop_charge_type</span>,  <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#20805;&#30005;&#31867;&#22411;</span>
   <span style="color: #268bd2;">power_supply_prop_health</span>,
   <span style="color: #268bd2;">power_supply_prop_present</span>,      <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#30005;&#27744;&#26159;&#21542;&#23384;&#22312;</span>
   <span style="color: #268bd2;">power_supply_prop_online</span>,       <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#30005;&#28304;&#26159;&#21542;&#36830;&#25509;</span>
   <span style="color: #268bd2;">power_supply_prop_authentic</span>,
   <span style="color: #268bd2;">power_supply_prop_battery_charging_enabled</span>, <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#30005;&#27744;&#20805;&#30005;&#20801;&#35768;</span>
   <span style="color: #268bd2;">power_supply_prop_charging_enabled</span>,  <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#20801;&#35768;&#20805;&#30005;</span>
   <span style="color: #268bd2;">power_supply_prop_technology</span>,

   <span style="color: #268bd2;">power_supply_prop_cycle_count</span>,
   <span style="color: #268bd2;">power_supply_prop_voltage_max</span>,   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#26368;&#22823;&#30005;&#21387;</span>
   <span style="color: #268bd2;">power_supply_prop_voltage_min</span>,   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#26368;&#23567;&#30005;&#21387;</span>
   <span style="color: #268bd2;">power_supply_prop_voltage_max_design</span>,
   <span style="color: #268bd2;">power_supply_prop_voltage_min_design</span>,
   <span style="color: #268bd2;">power_supply_prop_voltage_now</span>,
   <span style="color: #268bd2;">power_supply_prop_voltage_avg</span>,
   <span style="color: #268bd2;">power_supply_prop_voltage_ocv</span>,
   <span style="color: #268bd2;">power_supply_prop_input_voltage_regulation</span>,
   <span style="color: #268bd2;">power_supply_prop_current_max</span>,
   <span style="color: #268bd2;">power_supply_prop_input_current_max</span>,
   <span style="color: #268bd2;">power_supply_prop_input_current_trim</span>,
   <span style="color: #268bd2;">power_supply_prop_input_current_settled</span>,
   <span style="color: #268bd2;">power_supply_prop_vchg_loop_dbc_bypass</span>,
   <span style="color: #268bd2;">power_supply_prop_current_now</span>,
   <span style="color: #268bd2;">power_supply_prop_current_avg</span>,
   <span style="color: #268bd2;">power_supply_prop_power_now</span>,
   <span style="color: #268bd2;">power_supply_prop_power_avg</span>,

   <span style="color: #268bd2;">power_supply_prop_charge_full_design</span>,
   <span style="color: #268bd2;">power_supply_prop_charge_empty_design</span>,
   <span style="color: #268bd2;">power_supply_prop_charge_full</span>,
   <span style="color: #268bd2;">power_supply_prop_charge_empty</span>,
   <span style="color: #268bd2;">power_supply_prop_charge_now</span>,
   <span style="color: #268bd2;">power_supply_prop_charge_now_raw</span>,
   <span style="color: #268bd2;">power_supply_prop_charge_now_error</span>,
   <span style="color: #268bd2;">power_supply_prop_charge_avg</span>,
   <span style="color: #268bd2;">power_supply_prop_charge_counter</span>,
   <span style="color: #268bd2;">power_supply_prop_charge_counter_shadow</span>,
   <span style="color: #268bd2;">power_supply_prop_constant_charge_current</span>,
   <span style="color: #268bd2;">power_supply_prop_constant_charge_current_max</span>,
   <span style="color: #268bd2;">power_supply_prop_constant_charge_voltage</span>,
   <span style="color: #268bd2;">power_supply_prop_constant_charge_voltage_max</span>,
   <span style="color: #268bd2;">power_supply_prop_charge_control_limit</span>,
   <span style="color: #268bd2;">power_supply_prop_charge_control_limit_max</span>,

   <span style="color: #268bd2;">power_supply_prop_energy_full_design</span>,
   <span style="color: #268bd2;">power_supply_prop_energy_empty_design</span>,
   <span style="color: #268bd2;">power_supply_prop_energy_full</span>,
   <span style="color: #268bd2;">power_supply_prop_energy_empty</span>,
   <span style="color: #268bd2;">power_supply_prop_energy_now</span>,
   <span style="color: #268bd2;">power_supply_prop_energy_avg</span>,
   <span style="color: #268bd2;">power_supply_prop_hi_power</span>,
   <span style="color: #268bd2;">power_supply_prop_low_power</span>,
   <span style="color: #268bd2;">power_supply_prop_capacity</span>, <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">in percents! */</span>
   <span style="color: #268bd2;">power_supply_prop_capacity_alert_min</span>, <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">in percents! */</span>
   <span style="color: #268bd2;">power_supply_prop_capacity_alert_max</span>, <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">in percents! */</span>
   <span style="color: #268bd2;">power_supply_prop_capacity_level</span>,
   <span style="color: #268bd2;">power_supply_prop_capacity_raw</span>,
   <span style="color: #268bd2;">power_supply_prop_temp</span>,
   <span style="color: #268bd2;">power_supply_prop_temp_alert_min</span>,
   <span style="color: #268bd2;">power_supply_prop_temp_alert_max</span>,
   <span style="color: #268bd2;">power_supply_prop_cool_temp</span>,
   <span style="color: #268bd2;">power_supply_prop_warm_temp</span>,
   <span style="color: #268bd2;">power_supply_prop_temp_ambient</span>,
   <span style="color: #268bd2;">power_supply_prop_temp_ambient_alert_min</span>,
   <span style="color: #268bd2;">power_supply_prop_temp_ambient_alert_max</span>,
   <span style="color: #268bd2;">power_supply_prop_time_to_empty_now</span>,
   <span style="color: #268bd2;">power_supply_prop_time_to_empty_avg</span>,
   <span style="color: #268bd2;">power_supply_prop_time_to_full_now</span>,
   <span style="color: #268bd2;">power_supply_prop_time_to_full_avg</span>,
   <span style="color: #268bd2;">power_supply_prop_type</span>, <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">use power_supply.type instead */</span>
   <span style="color: #268bd2;">power_supply_prop_scope</span>,
   <span style="color: #268bd2;">power_supply_prop_system_temp_level</span>,
   <span style="color: #268bd2;">power_supply_prop_resistance</span>,
   <span style="color: #268bd2;">power_supply_prop_resistance_capacitive</span>,
   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">unit is in ohms due to id being typically in kohm range */</span>
   <span style="color: #268bd2;">power_supply_prop_resistance_id</span>,
   <span style="color: #268bd2;">power_supply_prop_resistance_now</span>,
   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">local extensions */</span>
   <span style="color: #268bd2;">power_supply_prop_usb_hc</span>,
   <span style="color: #268bd2;">power_supply_prop_usb_otg</span>,
   <span style="color: #268bd2;">power_supply_prop_charge_enabled</span>,   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#20805;&#30005;&#20801;&#35768;</span>
   <span style="color: #268bd2;">power_supply_prop_flash_current_max</span>,
   <span style="color: #268bd2;">power_supply_prop_update_now</span>,
   <span style="color: #268bd2;">power_supply_prop_esr_count</span>,
   <span style="color: #268bd2;">power_supply_prop_safety_timer_enable</span>,
   <span style="color: #268bd2;">power_supply_prop_charge_done</span>,
   <span style="color: #268bd2;">power_supply_prop_flash_active</span>,
   <span style="color: #268bd2;">power_supply_prop_flash_trigger</span>,
   <span style="color: #268bd2;">power_supply_prop_force_tlim</span>,
   <span style="color: #268bd2;">power_supply_prop_dp_dm</span>,
   <span style="color: #268bd2;">power_supply_prop_input_current_limited</span>,
   <span style="color: #268bd2;">power_supply_prop_input_current_now</span>,
   <span style="color: #268bd2;">power_supply_prop_rerun_aicl</span>,
   <span style="color: #268bd2;">power_supply_prop_cycle_count_id</span>,
   <span style="color: #268bd2;">power_supply_prop_safety_timer_expired</span>,
   <span style="color: #268bd2;">power_supply_prop_restricted_charging</span>,
   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">sun zhangyang add for task 1133932 begin</span>
<span style="color: #268bd2;"> #if</span> <span style="color: #268bd2;">defined</span>(config_tct_8x76_idol4)
     <span style="color: #268bd2;">power_supply_prop_tcl_fixtemp</span>,
     <span style="color: #268bd2;">power_supply_prop_tcl_fixcapacity</span>,
<span style="color: #268bd2;"> #endif</span>
     <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">sun zhangyang add for task 1133932 end</span>
   <span style="color: #268bd2;">power_supply_prop_allow_hvdcp3</span>,
     <span style="color: #268bd2;">power_supply_prop_xo_thermal</span>,<span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">[feature] mod-by sun zhangyang for defect2167030,2016.05.18</span>
   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">local extensions of type int64_t */</span>
   <span style="color: #268bd2;">power_supply_prop_charge_counter_ext</span>,
   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">properties of type `const char *' */</span>
   <span style="color: #268bd2;">power_supply_prop_model_name</span>,
   <span style="color: #268bd2;">power_supply_prop_manufacturer</span>,
   <span style="color: #268bd2;">power_supply_prop_serial_number</span>,
   <span style="color: #268bd2;">power_supply_prop_battery_type</span>,
 };
</pre>
</div></li>
<li><p>
power<sub>supply</sub><sub>info</sub>
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">power_supply_info</span> {
   <span style="color: #859900; font-weight: bold;">const</span> <span style="color: #b58900;">char</span> *<span style="color: #268bd2;">name</span>;      <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#21517;&#23383;</span>
   <span style="color: #b58900;">int</span> <span style="color: #268bd2;">technology</span>;        <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#25216;&#26415;:&#30005;&#27744;&#31867;&#22411;</span>
   <span style="color: #b58900;">int</span> <span style="color: #268bd2;">voltage_max_design</span>;<span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#26368;&#22823;&#30005;&#21387;</span>
   <span style="color: #b58900;">int</span> <span style="color: #268bd2;">voltage_min_design</span>;<span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#26368;&#23567;&#30005;&#21387;</span>
   <span style="color: #b58900;">int</span> <span style="color: #268bd2;">charge_full_design</span>;<span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#20805;&#28385;&#30005;&#30005;&#21387;</span>
   <span style="color: #b58900;">int</span> <span style="color: #268bd2;">charge_empty_design</span>;<span style="color: #93a1a1;">//</span>
   <span style="color: #b58900;">int</span> <span style="color: #268bd2;">energy_full_design</span>; <span style="color: #93a1a1;">//</span>
   <span style="color: #b58900;">int</span> <span style="color: #268bd2;">energy_empty_design</span>;<span style="color: #93a1a1;">//</span>
   <span style="color: #b58900;">int</span> <span style="color: #268bd2;">use_for_apm</span>;<span style="color: #93a1a1;">//</span>
 };
</pre>
</div></li>
</ol>
</div>
</div>
