android/power/01.driver/02.Frameworks.org
* Code
**  power_supply_core.c
   + 主要功能
     1. 在/sys/class/创建类"power_supply"(即：/sys/class/power_supply/)
   + 加载/卸载驱动模块
     #+begin_src cpp
     static int __init power_supply_class_init(void)
      {
        //创建类“power_supply”
        power_supply_class = class_create(THIS_MODULE, "power_supply");

        if (IS_ERR(power_supply_class))
          return PTR_ERR(power_supply_class);

        power_supply_class->dev_uevent = power_supply_uevent;
        power_supply_init_attrs(&power_supply_dev_type);

        return 0;
      }

      static void __exit power_supply_class_exit(void)
      {
        class_destroy(power_supply_class);//删除类
      }

      subsys_initcall(power_supply_class_init);//加载驱动
      module_exit(power_supply_class_exit);//卸载驱动
     #+end_src
