android/power/01.driver/02.Frameworks.html
<div id="outline-container-orgheadline25" class="outline-2">
<h2 id="orgheadline25"><span class="section-number-2">4</span> Code</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22"><span class="section-number-3">4.1</span> power<sub>supply</sub><sub>core.c</sub></h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>主要功能
<ol class="org-ol">
<li>在/sys/class/创建类"power<sub>supply</sub>"(即：/sys/class/power<sub>supply</sub>/)</li>
</ol></li>
<li><p>
加载/卸载驱动模块
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #859900; font-weight: bold;">static</span> <span style="color: #b58900;">int</span> <span style="color: #268bd2;">__init</span> power_supply_class_init(<span style="color: #b58900;">void</span>)
 {
   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#21019;&#24314;&#31867;&#8220;power_supply&#8221;</span>
   power_supply_class = class_create(THIS_MODULE, <span style="color: #2aa198;">"power_supply"</span>);

   <span style="color: #859900; font-weight: bold;">if</span> (IS_ERR(power_supply_class))
     <span style="color: #859900; font-weight: bold;">return</span> PTR_ERR(power_supply_class);

   power_supply_class-&gt;dev_uevent = power_supply_uevent;
   power_supply_init_attrs(&amp;power_supply_dev_type);

   <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #6c71c4;">0</span>;
 }

 <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #b58900;">void</span> <span style="color: #268bd2;">__exit</span> power_supply_class_exit(<span style="color: #b58900;">void</span>)
 {
   class_destroy(power_supply_class);<span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#21024;&#38500;&#31867;</span>
 }

 subsys_initcall(power_supply_class_init);<span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#21152;&#36733;&#39537;&#21160;</span>
 module_exit(power_supply_class_exit);<span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#21368;&#36733;&#39537;&#21160;</span>
</pre>
</div></li>
</ul>
</div>
</div>
