android/power/01.driver/02.Frameworks.org
** power_supply_sysfs.c
   1. POWER_SUPPLY_ATTR宏讲解
      #+begin_src cpp
      #define POWER_SUPPLY_ATTR(_name)					\
       {									\
         .attr = { .name = #_name },					\
         .show = power_supply_show_property,				\
         .store = power_supply_store_property,				\
       }
   
       static struct device_attribute power_supply_attrs[] = {
         /* Properties of type `int' */
         POWER_SUPPLY_ATTR(status),
         POWER_SUPPLY_ATTR(charge_type),
         ...
       }
      #+end_src
       以status为例，等价于
      #+begin_src cpp
       static struct device_attribute power_supply_attrs[] = {
            {
               .attr = { .name = "status" },
               .show = power_supply_show_property,//显示属性到buf中
               .store = power_supply_store_property,
            }
       }
       #+end_src
   2. power_supply_show_property()
      #+begin_src cpp
      static ssize_t power_supply_show_property(struct device *dev, struct device_attribute *attr, char *buf) {
         //类型
         //未知　电池　
         static char *type_text[] = {
           "Unknown", "Battery", "UPS", "Mains", "USB",
           "USB_DCP", "USB_CDP", "USB_ACA",
           "USB_HVDCP", "USB_HVDCP_3", "Wireless", "BMS", "USB_Parallel",
           "Wipower"
         };
         //状态
         //未知　充电 禁止充电　没充电　满电
         static char *status_text[] = {
           "Unknown", "Charging", "Discharging", "Not charging", "Full"
         };
         //充电类型
         static char *charge_type[] = {
           "Unknown", "N/A", "Trickle", "Fast", "Taper"
         };
   
         //健康()
         static char *health_text[] = {
           "Unknown", "Good", "Overheat", "Warm", "Dead", "Over voltage",
           "Unspecified failure", "Cold", "Cool", "Watchdog timer expire",
           "Safety timer expire"
         };
   
         //技术
         //未知，镍氢电池　锂电池  锂聚合物电池  锂铁电池  镍镉电池　锂电池
         static char *technology_text[] = {
           "Unknown", "NiMH", "Li-ion", "Li-poly", "LiFe", "NiCd",
           "LiMn"
         };
   
         //容量
         static char *capacity_level_text[] = {
           "Unknown", "Critical", "Low", "Normal", "High", "Full"
         };
   
         //范围
         static char *scope_text[] = {
           "Unknown", "System", "Device"
         };
         ssize_t ret = 0;
         struct power_supply *psy = dev_get_drvdata(dev);
   
         //这是计算偏移量，它的偏移值和枚举类型中的power_supply_property值对应的
         const ptrdiff_t off = attr - power_supply_attrs;
         union power_supply_propval value;
   
         /*查看类型*/
         if (off == POWER_SUPPLY_PROP_TYPE)
           value.intval = psy->type;  //电源类型
         else
           //函数原型好像是这个smbchg_battery_get_property()
           ret = psy->get_property(psy, off, &value);//类型也保存在value.intval
   
   
         if (off == POWER_SUPPLY_PROP_STATUS)//状态
           return sprintf(buf, "%s\n", status_text[value.intval]);
   
         else if (off == POWER_SUPPLY_PROP_CHARGE_TYPE)//充电类型
           return sprintf(buf, "%s\n", charge_type[value.intval]);
   
         else if (off == POWER_SUPPLY_PROP_HEALTH) //充电健康程度
           return sprintf(buf, "%s\n", health_text[value.intval]);
   
         else if (off == POWER_SUPPLY_PROP_TECHNOLOGY) //技术(电池种类)
           return sprintf(buf, "%s\n", technology_text[value.intval]);
   
         else if (off == POWER_SUPPLY_PROP_CAPACITY_LEVEL)  //容量
           return sprintf(buf, "%s\n", capacity_level_text[value.intval]);
   
         else if (off == POWER_SUPPLY_PROP_TYPE)  //类型
           return sprintf(buf, "%s\n", type_text[value.intval]);
   
         else if (off == POWER_SUPPLY_PROP_SCOPE) //范围
           return sprintf(buf, "%s\n", scope_text[value.intval]);
   
         else if (off >= POWER_SUPPLY_PROP_MODEL_NAME)//模型名
           return sprintf(buf, "%s\n", value.strval);
   
         if (off == POWER_SUPPLY_PROP_CHARGE_COUNTER_EXT)//充电计数
           return sprintf(buf, "%lld\n", value.int64val);
         else
           return sprintf(buf, "%d\n", value.intval);
       }
      #+end_src
   3. power_supply_store_property()
      #+begin_src cpp
      static ssize_t power_supply_store_property(struct device *dev, struct device_attribute *attr, const char *buf, size_t count) {
        ssize_t ret;
        struct power_supply *psy = dev_get_drvdata(dev);
        const ptrdiff_t off = attr - power_supply_attrs;
        union power_supply_propval value;
        long long_val;
   
        /* TODO: support other types than int */
        ret = strict_strtol(buf, 10, &long_val);
        if (ret < 0)
          return ret;
   
        value.intval = long_val;
   
        //原型smbchg_battery_set_property()
        ret = psy->set_property(psy, off, &value);
        if (ret < 0)
          return ret;
   
        return count;
      }
      #+end_src
   4. static umode_t power_supply_attr_is_visible(struct kobject *kobj, struct attribute *attr, int attrno)
      设备文件的访问权限设置
   5. power_supply_uevent()
      #+begin_src cpp
      int power_supply_uevent(struct device *dev, struct kobj_uevent_env *env)
       {
         struct power_supply *psy = dev_get_drvdata(dev);//获取私有数据(内核空间)

         //给环境变量写入env中
         //将键值字符串添加到环境缓冲区env中
         ret = add_uevent_var(env, "POWER_SUPPLY_NAME=%s", psy->name);

         //分配内存,值都为0
         prop_buf = (char *)get_zeroed_page(GFP_KERNEL);


         for (j = 0; j < psy->num_properties; j++) {
           struct device_attribute *attr;
           char *line;

           //在power_supply_sysfs.c
           attr = &power_supply_attrs[psy->properties[j]];

           ret = power_supply_show_property(dev, attr, prop_buf);
           if (ret == -ENODEV || ret == -ENODATA) {
             /* When a battery is absent, we expect -ENODEV. Don't abort;
                send the uevent with at least the the PRESENT=0 property */
             ret = 0;
             continue;
           }

           if (ret < 0)
             goto out;

           //查找'\n'首次出现的位置  
           line = strchr(prop_buf, '\n');
           if (line)
             *line = 0;

           attrname = kstruprdup(attr->attr.name, GFP_KERNEL);
           if (!attrname) {
             ret = -ENOMEM;
             goto out;
           }

           dev_dbg(dev, "prop %s=%s\n", attrname, prop_buf);

           ret = add_uevent_var(env, "POWER_SUPPLY_%s=%s", attrname, prop_buf);
           kfree(attrname);

             goto out;
         }

       out:
         free_page((unsigned long)prop_buf);

         return ret;
       }
      #+end_src
