android/power/01.driver/02.Frameworks.html
<div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23"><span class="section-number-3">4.2</span> power<sub>supply</sub><sub>sysfs.c</sub></h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li><p>
POWER<sub>SUPPLY</sub><sub>ATTR宏讲解</sub>
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #268bd2;">#define</span> <span style="color: #268bd2;">POWER_SUPPLY_ATTR</span>(<span style="color: #268bd2;">_name</span>)          \
 {                  \
   .attr = { .name = #_name },          \
   .show = power_supply_show_property,        \
   .store = power_supply_store_property,        \
 }

 <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">device_attribute</span> <span style="color: #268bd2;">power_supply_attrs</span>[] = {
   <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">Properties of type `int' */</span>
   POWER_SUPPLY_ATTR(status),
   POWER_SUPPLY_ATTR(charge_type),
   ...
 }
</pre>
</div>
<p>
以status为例，等价于
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #859900; font-weight: bold;">static</span> <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">device_attribute</span> <span style="color: #268bd2;">power_supply_attrs</span>[] = {
     {
        .attr = { .name = <span style="color: #2aa198;">"status"</span> },
        .show = power_supply_show_property,<span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#26174;&#31034;&#23646;&#24615;&#21040;buf&#20013;</span>
        .store = power_supply_store_property,
     }
}
</pre>
</div></li>
<li><p>
power<sub>supply</sub><sub>show</sub><sub>property</sub>()
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #859900; font-weight: bold;">static</span> <span style="color: #b58900;">ssize_t</span> <span style="color: #268bd2;">power_supply_show_property</span>(<span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">device</span> *<span style="color: #268bd2;">dev</span>, <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">device_attribute</span> *<span style="color: #268bd2;">attr</span>, <span style="color: #b58900;">char</span> *<span style="color: #268bd2;">buf</span>) {
   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#31867;&#22411;</span>
   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#26410;&#30693;&#12288;&#30005;&#27744;&#12288;</span>
   <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #b58900;">char</span> *<span style="color: #268bd2;">type_text</span>[] = {
     <span style="color: #2aa198;">"Unknown"</span>, <span style="color: #2aa198;">"Battery"</span>, <span style="color: #2aa198;">"UPS"</span>, <span style="color: #2aa198;">"Mains"</span>, <span style="color: #2aa198;">"USB"</span>,
     <span style="color: #2aa198;">"USB_DCP"</span>, <span style="color: #2aa198;">"USB_CDP"</span>, <span style="color: #2aa198;">"USB_ACA"</span>,
     <span style="color: #2aa198;">"USB_HVDCP"</span>, <span style="color: #2aa198;">"USB_HVDCP_3"</span>, <span style="color: #2aa198;">"Wireless"</span>, <span style="color: #2aa198;">"BMS"</span>, <span style="color: #2aa198;">"USB_Parallel"</span>,
     <span style="color: #2aa198;">"Wipower"</span>
   };
   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#29366;&#24577;</span>
   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#26410;&#30693;&#12288;&#20805;&#30005; &#31105;&#27490;&#20805;&#30005;&#12288;&#27809;&#20805;&#30005;&#12288;&#28385;&#30005;</span>
   <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #b58900;">char</span> *<span style="color: #268bd2;">status_text</span>[] = {
     <span style="color: #2aa198;">"Unknown"</span>, <span style="color: #2aa198;">"Charging"</span>, <span style="color: #2aa198;">"Discharging"</span>, <span style="color: #2aa198;">"Not charging"</span>, <span style="color: #2aa198;">"Full"</span>
   };
   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#20805;&#30005;&#31867;&#22411;</span>
   <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #b58900;">char</span> *<span style="color: #268bd2;">charge_type</span>[] = {
     <span style="color: #2aa198;">"Unknown"</span>, <span style="color: #2aa198;">"N/A"</span>, <span style="color: #2aa198;">"Trickle"</span>, <span style="color: #2aa198;">"Fast"</span>, <span style="color: #2aa198;">"Taper"</span>
   };

   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#20581;&#24247;()</span>
   <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #b58900;">char</span> *<span style="color: #268bd2;">health_text</span>[] = {
     <span style="color: #2aa198;">"Unknown"</span>, <span style="color: #2aa198;">"Good"</span>, <span style="color: #2aa198;">"Overheat"</span>, <span style="color: #2aa198;">"Warm"</span>, <span style="color: #2aa198;">"Dead"</span>, <span style="color: #2aa198;">"Over voltage"</span>,
     <span style="color: #2aa198;">"Unspecified failure"</span>, <span style="color: #2aa198;">"Cold"</span>, <span style="color: #2aa198;">"Cool"</span>, <span style="color: #2aa198;">"Watchdog timer expire"</span>,
     <span style="color: #2aa198;">"Safety timer expire"</span>
   };

   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#25216;&#26415;</span>
   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#26410;&#30693;&#65292;&#38221;&#27682;&#30005;&#27744;&#12288;&#38146;&#30005;&#27744;  &#38146;&#32858;&#21512;&#29289;&#30005;&#27744;  &#38146;&#38081;&#30005;&#27744;  &#38221;&#38217;&#30005;&#27744;&#12288;&#38146;&#30005;&#27744;</span>
   <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #b58900;">char</span> *<span style="color: #268bd2;">technology_text</span>[] = {
     <span style="color: #2aa198;">"Unknown"</span>, <span style="color: #2aa198;">"NiMH"</span>, <span style="color: #2aa198;">"Li-ion"</span>, <span style="color: #2aa198;">"Li-poly"</span>, <span style="color: #2aa198;">"LiFe"</span>, <span style="color: #2aa198;">"NiCd"</span>,
     <span style="color: #2aa198;">"LiMn"</span>
   };

   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#23481;&#37327;</span>
   <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #b58900;">char</span> *<span style="color: #268bd2;">capacity_level_text</span>[] = {
     <span style="color: #2aa198;">"Unknown"</span>, <span style="color: #2aa198;">"Critical"</span>, <span style="color: #2aa198;">"Low"</span>, <span style="color: #2aa198;">"Normal"</span>, <span style="color: #2aa198;">"High"</span>, <span style="color: #2aa198;">"Full"</span>
   };

   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#33539;&#22260;</span>
   <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #b58900;">char</span> *<span style="color: #268bd2;">scope_text</span>[] = {
     <span style="color: #2aa198;">"Unknown"</span>, <span style="color: #2aa198;">"System"</span>, <span style="color: #2aa198;">"Device"</span>
   };
   <span style="color: #b58900;">ssize_t</span> <span style="color: #268bd2;">ret</span> = <span style="color: #6c71c4;">0</span>;
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">power_supply</span> *<span style="color: #268bd2;">psy</span> = dev_get_drvdata(dev);

   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#36825;&#26159;&#35745;&#31639;&#20559;&#31227;&#37327;&#65292;&#23427;&#30340;&#20559;&#31227;&#20540;&#21644;&#26522;&#20030;&#31867;&#22411;&#20013;&#30340;power_supply_property&#20540;&#23545;&#24212;&#30340;</span>
   <span style="color: #859900; font-weight: bold;">const</span> <span style="color: #b58900;">ptrdiff_t</span> <span style="color: #268bd2;">off</span> = attr - power_supply_attrs;
   <span style="color: #859900; font-weight: bold;">union</span> <span style="color: #b58900;">power_supply_propval</span> <span style="color: #268bd2;">value</span>;

   <span style="color: #93a1a1;">/*</span><span style="color: #93a1a1;">&#26597;&#30475;&#31867;&#22411;*/</span>
   <span style="color: #859900; font-weight: bold;">if</span> (off == POWER_SUPPLY_PROP_TYPE)
     value.intval = psy-&gt;type;  <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#30005;&#28304;&#31867;&#22411;</span>
   <span style="color: #859900; font-weight: bold;">else</span>
     <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#20989;&#25968;&#21407;&#22411;&#22909;&#20687;&#26159;&#36825;&#20010;smbchg_battery_get_property()</span>
     ret = psy-&gt;get_property(psy, off, &amp;value);<span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#31867;&#22411;&#20063;&#20445;&#23384;&#22312;value.intval</span>


   <span style="color: #859900; font-weight: bold;">if</span> (off == POWER_SUPPLY_PROP_STATUS)<span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#29366;&#24577;</span>
     <span style="color: #859900; font-weight: bold;">return</span> sprintf(buf, <span style="color: #2aa198;">"%s\n"</span>, status_text[value.intval]);

   <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900; font-weight: bold;">if</span> (off == POWER_SUPPLY_PROP_CHARGE_TYPE)<span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#20805;&#30005;&#31867;&#22411;</span>
     <span style="color: #859900; font-weight: bold;">return</span> sprintf(buf, <span style="color: #2aa198;">"%s\n"</span>, charge_type[value.intval]);

   <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900; font-weight: bold;">if</span> (off == POWER_SUPPLY_PROP_HEALTH) <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#20805;&#30005;&#20581;&#24247;&#31243;&#24230;</span>
     <span style="color: #859900; font-weight: bold;">return</span> sprintf(buf, <span style="color: #2aa198;">"%s\n"</span>, health_text[value.intval]);

   <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900; font-weight: bold;">if</span> (off == POWER_SUPPLY_PROP_TECHNOLOGY) <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#25216;&#26415;(&#30005;&#27744;&#31181;&#31867;)</span>
     <span style="color: #859900; font-weight: bold;">return</span> sprintf(buf, <span style="color: #2aa198;">"%s\n"</span>, technology_text[value.intval]);

   <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900; font-weight: bold;">if</span> (off == POWER_SUPPLY_PROP_CAPACITY_LEVEL)  <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#23481;&#37327;</span>
     <span style="color: #859900; font-weight: bold;">return</span> sprintf(buf, <span style="color: #2aa198;">"%s\n"</span>, capacity_level_text[value.intval]);

   <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900; font-weight: bold;">if</span> (off == POWER_SUPPLY_PROP_TYPE)  <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#31867;&#22411;</span>
     <span style="color: #859900; font-weight: bold;">return</span> sprintf(buf, <span style="color: #2aa198;">"%s\n"</span>, type_text[value.intval]);

   <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900; font-weight: bold;">if</span> (off == POWER_SUPPLY_PROP_SCOPE) <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#33539;&#22260;</span>
     <span style="color: #859900; font-weight: bold;">return</span> sprintf(buf, <span style="color: #2aa198;">"%s\n"</span>, scope_text[value.intval]);

   <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900; font-weight: bold;">if</span> (off &gt;= POWER_SUPPLY_PROP_MODEL_NAME)<span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#27169;&#22411;&#21517;</span>
     <span style="color: #859900; font-weight: bold;">return</span> sprintf(buf, <span style="color: #2aa198;">"%s\n"</span>, value.strval);

   <span style="color: #859900; font-weight: bold;">if</span> (off == POWER_SUPPLY_PROP_CHARGE_COUNTER_EXT)<span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#20805;&#30005;&#35745;&#25968;</span>
     <span style="color: #859900; font-weight: bold;">return</span> sprintf(buf, <span style="color: #2aa198;">"%lld\n"</span>, value.int64val);
   <span style="color: #859900; font-weight: bold;">else</span>
     <span style="color: #859900; font-weight: bold;">return</span> sprintf(buf, <span style="color: #2aa198;">"%d\n"</span>, value.intval);
 }
</pre>
</div></li>
<li><p>
power<sub>supply</sub><sub>store</sub><sub>property</sub>()
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #859900; font-weight: bold;">static</span> <span style="color: #b58900;">ssize_t</span> <span style="color: #268bd2;">power_supply_store_property</span>(<span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">device</span> *<span style="color: #268bd2;">dev</span>, <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">device_attribute</span> *<span style="color: #268bd2;">attr</span>, <span style="color: #859900; font-weight: bold;">const</span> <span style="color: #b58900;">char</span> *<span style="color: #268bd2;">buf</span>, <span style="color: #b58900;">size_t</span> <span style="color: #268bd2;">count</span>) {
  <span style="color: #b58900;">ssize_t</span> <span style="color: #268bd2;">ret</span>;
  <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">power_supply</span> *<span style="color: #268bd2;">psy</span> = dev_get_drvdata(dev);
  <span style="color: #859900; font-weight: bold;">const</span> <span style="color: #b58900;">ptrdiff_t</span> <span style="color: #268bd2;">off</span> = attr - power_supply_attrs;
  <span style="color: #859900; font-weight: bold;">union</span> <span style="color: #b58900;">power_supply_propval</span> <span style="color: #268bd2;">value</span>;
  <span style="color: #b58900;">long</span> <span style="color: #268bd2;">long_val</span>;

  <span style="color: #93a1a1;">/* </span><span style="color: #cc9393;">TODO</span><span style="color: #93a1a1;">: support other types than int */</span>
  ret = strict_strtol(buf, <span style="color: #6c71c4;">10</span>, &amp;long_val);
  <span style="color: #859900; font-weight: bold;">if</span> (ret &lt; <span style="color: #6c71c4;">0</span>)
    <span style="color: #859900; font-weight: bold;">return</span> ret;

  value.intval = long_val;

  <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#21407;&#22411;smbchg_battery_set_property()</span>
  ret = psy-&gt;set_property(psy, off, &amp;value);
  <span style="color: #859900; font-weight: bold;">if</span> (ret &lt; <span style="color: #6c71c4;">0</span>)
    <span style="color: #859900; font-weight: bold;">return</span> ret;

  <span style="color: #859900; font-weight: bold;">return</span> count;
}
</pre>
</div></li>
<li>static umode<sub>t</sub> power<sub>supply</sub><sub>attr</sub><sub>is</sub><sub>visible</sub>(struct kobject *kobj, struct attribute *attr, int attrno)
设备文件的访问权限设置</li>
<li><p>
power<sub>supply</sub><sub>uevent</sub>()
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #b58900;">int</span> <span style="color: #268bd2;">power_supply_uevent</span>(<span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">device</span> *<span style="color: #268bd2;">dev</span>, <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">kobj_uevent_env</span> *<span style="color: #268bd2;">env</span>)
 {
   <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">power_supply</span> *<span style="color: #268bd2;">psy</span> = dev_get_drvdata(dev);<span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#33719;&#21462;&#31169;&#26377;&#25968;&#25454;(&#20869;&#26680;&#31354;&#38388;)</span>

   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#32473;&#29615;&#22659;&#21464;&#37327;&#20889;&#20837;env&#20013;</span>
   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#23558;&#38190;&#20540;&#23383;&#31526;&#20018;&#28155;&#21152;&#21040;&#29615;&#22659;&#32531;&#20914;&#21306;env&#20013;</span>
   ret = add_uevent_var(env, <span style="color: #2aa198;">"POWER_SUPPLY_NAME=%s"</span>, psy-&gt;name);

   <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#20998;&#37197;&#20869;&#23384;,&#20540;&#37117;&#20026;0</span>
   prop_buf = (<span style="color: #b58900;">char</span> *)get_zeroed_page(GFP_KERNEL);


   <span style="color: #859900; font-weight: bold;">for</span> (j = <span style="color: #6c71c4;">0</span>; j &lt; psy-&gt;num_properties; j++) {
     <span style="color: #859900; font-weight: bold;">struct</span> <span style="color: #b58900;">device_attribute</span> *<span style="color: #268bd2;">attr</span>;
     <span style="color: #b58900;">char</span> *<span style="color: #268bd2;">line</span>;

     <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#22312;power_supply_sysfs.c</span>
     attr = &amp;power_supply_attrs[psy-&gt;properties[j]];

     ret = power_supply_show_property(dev, attr, prop_buf);
     <span style="color: #859900; font-weight: bold;">if</span> (ret == -ENODEV || ret == -ENODATA) {
       <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">When a battery is absent, we expect -ENODEV. Don't abort;</span>
<span style="color: #93a1a1;">          send the uevent with at least the the PRESENT=0 property */</span>
       ret = <span style="color: #6c71c4;">0</span>;
       <span style="color: #859900; font-weight: bold;">continue</span>;
     }

     <span style="color: #859900; font-weight: bold;">if</span> (ret &lt; <span style="color: #6c71c4;">0</span>)
       <span style="color: #859900; font-weight: bold;">goto</span> <span style="color: #268bd2; font-weight: bold;">out</span>;

     <span style="color: #93a1a1;">//</span><span style="color: #93a1a1;">&#26597;&#25214;'\n'&#39318;&#27425;&#20986;&#29616;&#30340;&#20301;&#32622;  </span>
     line = strchr(prop_buf, <span style="color: #2aa198;">'\n'</span>);
     <span style="color: #859900; font-weight: bold;">if</span> (line)
       *line = <span style="color: #6c71c4;">0</span>;

     attrname = kstruprdup(attr-&gt;attr.name, GFP_KERNEL);
     <span style="color: #859900; font-weight: bold;">if</span> (<span style="color: #b58900; font-weight: bold;">!</span>attrname) {
       ret = -ENOMEM;
       <span style="color: #859900; font-weight: bold;">goto</span> <span style="color: #268bd2; font-weight: bold;">out</span>;
     }

     dev_dbg(dev, <span style="color: #2aa198;">"prop %s=%s\n"</span>, attrname, prop_buf);

     ret = add_uevent_var(env, <span style="color: #2aa198;">"POWER_SUPPLY_%s=%s"</span>, attrname, prop_buf);
     kfree(attrname);

       <span style="color: #859900; font-weight: bold;">goto</span> <span style="color: #268bd2; font-weight: bold;">out</span>;
   }

 <span style="color: #268bd2; font-weight: bold;">out</span>:
   free_page((<span style="color: #b58900;">unsigned</span> <span style="color: #b58900;">long</span>)prop_buf);

   <span style="color: #859900; font-weight: bold;">return</span> ret;
 }
</pre>
</div></li>
</ol>
</div>
</div>
